# MetalPatternHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Metal..::..MetalPatternHeight Property
Metal Class See Also
---
The property labeled "Amount" from the "Metal" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetalPatternHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetalPatternHeight As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetalPatternHeight {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".
# See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace